Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/eu_healthcare/travelling_for_healthcare.html.txt.tmx
Source language: en
Languages: ga

source: If you are resident in Ireland you can choose to access healthcare in other countries in the European Union (EU), the European Economic Area (the EEA also includes Iceland, Liechtenstein and Norway) or Switzerland
ga: Má tá cónaí in Éirinn ort, féadfaidh tú a roghnú chun rochtain a fháil ar chúram sláinte i dtíortha eile san Aontas Eorpach (an AE), an Limistéar Eorpach Eacnamaíochta (tá an Íoslainn, Lichtinstéin agus Iorua sa LEE chomh maith) nó san Eilvéis

source: You can get planned healthcare abroad under the Treatment Abroad Scheme or the Cross-Border Healthcare Directive
ga: Féadfaidh tú cúram sláinte pleanáilte a fháil faoin Scéim um Chóireáil Thar Lear nó faoin Treoir um Chúram Sláinte Trasteorann

source: In general, the Cross-Border Healthcare Directive only covers treatments that are available in Ireland while the Treatment Abroad Scheme covers treatments that are not available in Ireland
ga: Go ginearálta, ní chumhdaíonn an Treoir um Chúram Sláinte Trasteorann cóireálacha atá ar fáil in Éirinn agus cumhdaíonn an Scéim um Chóireáil Thar Lear cóireálacha nach bhfuil ar fáil in Éirinn

source: If a treatment is covered by the Treatment Abroad Scheme, you cannot get a refund for it under the Cross-Border Healthcare Directive, so it is important to apply under the appropriate scheme
ga: Má tá cóireáil cumhdaithe faoin Scéim um Chóireáil Thar Lear, ní féidir leat aisíocaíocht a fháil di faoin Scéim um Chóireáil Thar Lear, mar sin, is tábhachtach chun iarratas a dhéanamh faoin scéim chuí

source: The differences are summarised below, with links to more detailed information
ga: Tugtar achoimre ar na difríochtaí thíos, agus soláthraítear naisc le faisnéis níos mionsonraithe

source: The European Health Insurance Card does not entitle you to travel abroad with the aim of getting public healthcare
ga: Ní thugann an Cárta Eorpach um Árachas Sláinte an teidlíocht duit taisteal thar lear agus é ina aidhm cúram sláinte poiblí a fháil

source: It covers unplanned healthcare for Irish residents who become sick or injured while travelling in another country in the EU, EEA or Switzerland
ga: Cumhdaíonn sé cúram sláinte neamhphleanáilte do chónaitheoirí na hÉireann a dtagann breoiteacht orthu nó a ngortaítear iad fad atá siad ag taisteal i dtír eile san AE, LEE nó san Eilvéis

source: If you are entitled to health services that are publicly funded and available in Ireland, you may opt to access those services in another member state of the EU or EEA under the Cross-Border Healthcare Directive
ga: Má tá tú i dteideal seirbhísí sláinte a fháil a chistítear go poiblí agus atá ar fáil in Éirinn, féadfaidh tú a roghnú chun na seirbhísí siúd a rochtain i mballstát eile an AE nó an LEE faoin Treoir um Chúram Sláinte Trasteorann

source: • The treatment abroad can be in public or private healthcare
ga: • Féadfaidh an chóireáil thar lear a bheith i gcúram sláinte poiblí nó príobháideach

source: • Some types of treatment need to be authorised in advance
ga: • Is gá roinnt saghsanna de chóireáil a údarú roimh ré

source: • You pay for the healthcare and then apply for a refund
ga: • Íocann tú as an gcúram sláinte agus déanann tú iarratas ar aisíocaíocht ina dhiaidh sin

source: • You need the same kind of referral for healthcare abroad as you would for healthcare in Ireland
ga: • Teastaíonn an saghas céanna d’atreorú uait le haghaidh cúram sláinte thar lear a bheadh ag teastáil uait le haghaidh cúram sláinte in Éirinn

source: For example, from a GP (family doctor) or hospital consultant
ga: Mar shampla, atreorú ó LG (dochtúir teaghlaigh) nó ó chomhairleach ospidéil

source: • Travel costs and living expenses abroad are not covered
ga: • Ní chumhdaítear costais taistil agus costais mhaireachtála thar lear

source: Read more about the Cross-Border Healthcare Directive
ga: Is féidir níos mó a léamh faoin Treoir um Chúram Sláinte Trasteorann anseo

source: If you are a public healthcare patient and require treatment that is not available in Ireland or, taking account of your medical circumstances, is not available within the time normally necessary to obtain it, you may be able to use the Treatment Abroad Scheme to get the treatment in another country in the EU, EEA or Switzerland
ga: Más othar cúram sláinte poiblí thú agus má theastaíonn cóireáil uait nach bhfuil ar fáil in Éirinn nó, agus do chúinsí leighis á gcur san áireamh, nach bhfuil ar fáil laistigh den tréimhse ama is gnách go dteastaíonn go gcuirfear an chóireáil sin ort, b’fhéidir go mbeidh tú in ann an Scéim um Chóireáil Thar Lear a úsáid go gcuirfear an chóireáil ort i dtír eile san AE, an LEE nó san Eilvéis

source: • The treatment abroad must be in public healthcare
ga: • Ní mór go mbeidh an chóireáil thar lear i gcúram sláinte poiblí

source: • Treatment must be pre-authorised
ga: • Ní mór go mbeadh an chóireáil réamhúdaraithe

source: • You do not have to pay the healthcare provider abroad for pre-authorised treatment
ga: • Ní gá duit an soláthraí cúram sláinte thar lear a íoc as cóireáil réamhúdaraithe

source: • You must be referred for treatment abroad by an Irish-based consultant who is treating you as a public patient
ga: • Ní mór go n-atreoróidh comhairleach atá bunaithe in Éirinn thú a bhfuil cóir leighis á cur aige/aici ort mar othar poiblí, i dtaobh cóireála thar lear

source: You cannot refer yourself or be referred by a GP
ga: Ní féidir leat tú féin a atreorú ná ní féidir le LG thú a atreorú

source: • The Treatment Abroad Scheme may provide assistance with travel costs for the patient and a travelling companion where appropriate
ga: • D’fhéadfadh an Scéim um Chóireáil Thar Lear cúnamh a sholáthar leis na costais taistil a mbíonn ar an othar íoc astu agus costais chompánach taistil, nuair is cuí

source: Read more about the Treatment Abroad Scheme
ga: Is féidir níos mó a léamh faoin Scéim um Chóireáil Thar Lear anseo
